const countriesRaw = `1,蝦夷,蠣崎慶広,26,伊勢,北畠具教
2,陸奥,伊達輝宗,27,志摩,九鬼嘉隆
3,陸中,南部晴政,28,近江,浅井長政
4,陸前,伊達政宗,29,山城,足利義輝
5,羽後,小野寺景道,30,大和,松永久秀
6,羽前,最上義光,31,紀伊,畠山高政
7,越後,上杉謙信,32,和泉,三好長慶
8,下野,宇都宮広綱,33,摂津,池田勝正
9,上野,長野業正,34,丹波,波多野秀治
10,常陸,佐竹義重,35,丹後,一色義道
11,下総,結城政勝,36,但馬,山名祐豊
12,上総,里見義堯,37,播磨,赤松義祐
13,安房,里見義弘,38,因幡,山名豊国
14,武蔵,太田資正,39,伯耆,南条宗勝
15,相模,北条氏康,40,出雲,尼子義久
16,甲斐,武田信玄,41,石見,毛利元就
17,信濃,村上義清,42,備前,宇喜多直家
18,駿河,今川義元,43,備中,三村家親
19,遠江,飯尾連龍,44,安芸,毛利隆元
20,三河,徳川家康,45,周防,大内義長
21,尾張,織田信長,46,阿波,三好義賢
22,美濃,斎藤道三,47,讃岐,十河一存
23,飛騨,姉小路良頼,48,伊予,河野通宣
24,越中,神保長職,49,土佐,長宗我部元親
25,能登,畠山義綱,50,筑前,大友宗麟`;

const lines = countriesRaw.split('\n');
const list = [];
lines.forEach(l => {
  const p = l.split(',');
  list.push({ id: parseInt(p[0]), name: p[1], gen: p[2] });
  list.push({ id: parseInt(p[3]), name: p[4], gen: p[5] });
});
list.sort((a,b) => a.id - b.id);

console.log(JSON.stringify(list, null, 2));
